---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.HostObjFailures
source: html/8e0523af-be33-d890-31e3-76035fc0eb13.htm
---
# BuiltInFailures.HostObjFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.